app/views/purchases/_form.html.erb

    <!--<%= form.text_field :item_id, id: :purchase_item_id %>-->
    <%= form.collection_select(:item_id, Item.all, :id, :item_name) %>
---
SELECT "items".* FROM "items"