app/views/orders/_form.html.erb

    <!--<%= form.text_field :item_id, id: :order_item_id %>-->
     <%= form.collection_select(:item_id, Item.all, :id, :id) %>
---
SELECT "items".* FROM "items"