app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
---
        <td><%= order.item_id %></td>
        <td><%= order.order_quantity %></td>