app/views/items/_form.html.erb

SELECT "sorts".* FROM "sorts"
---
<!--    <%= form.text_field :sort_id, id: :item_sort_id %> -->
     <%= form.collection_select(:sort_id, Sort.all, :id, :sort_name) %>