app/controllers/items_controller.rb

  def index
   @items= Item.select('orders.item_id,item_name,items.sort_id,sorts.sort_name, sum(purchase_quantity-order_quantity) as stock').joins(:purchases,:orders,:sort).group("orders.item_id")
---
SELECT orders.item_id,item_name,items.sort_id,sorts.sort_name, sum(purchase_quantity-order_quantity) as stock FROM "items" INNER JOIN "purchases" ON "purchases"."item_id" = "items"."id" INNER JOIN "orders" ON "orders"."item_id" = "items"."id" INNER JOIN "sorts" ON "sorts"."id" = "items"."sort_id" GROUP BY orders.item_id

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("item_name", "sort_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_name", "潮猛漁夫帽"], ["sort_id", "1"], ["created_at", "2018-01-18 07:08:10.835957"], ["updated_at", "2018-01-18 07:08:10.835957"]]