app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("item_id", "order_quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", "1"], ["order_quantity", "1"], ["created_at", "2018-01-18 07:20:28.022856"], ["updated_at", "2018-01-18 07:20:28.022856"]]