app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases"
---
  def index
    @purchases = Purchase.all

INSERT INTO "purchases" ("item_id", "purchase_quantity", "purchase_cost", "purchase_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", "1"], ["purchase_quantity", "100"], ["purchase_cost", "10"], ["purchase_price", "200"], ["created_at", "2018-01-18 07:19:20.347253"], ["updated_at", "2018-01-18 07:19:20.347253"]]
---
  def create
    @purchase = Purchase.new(purchase_params)

    respond_to do |format|
      if @purchase.save

DELETE FROM "purchases" WHERE "purchases"."id" = ?  [["id", 1]]
---
  def destroy
    @purchase.destroy