app/controllers/sorts_controller.rb

  def index
    @sorts = Sort.all
---
SELECT "sorts".* FROM "sorts"

  def create
    @sort = Sort.new(sort_params)

    respond_to do |format|
      if @sort.save
---
INSERT INTO "sorts" ("sort_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["sort_name", "漁夫帽"], ["created_at", "2018-01-18 07:02:53.768778"], ["updated_at", "2018-01-18 07:02:53.768778"]]

    def set_sort
      @sort = Sort.find(params[:id])
---
SELECT  "sorts".* FROM "sorts" WHERE "sorts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]